In [324]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [325]:
%%sql
sqlite:///CourseData.db
DROP TABLE IF EXISTS COURSES;
DROP TABLE IF EXISTS SECTIONS;
DROP TABLE IF EXISTS CLASSROOMS;
DROP TABLE IF EXISTS SCHEDULES;
DROP TABLE IF EXISTS INSTRUCTORS;

Done.
Done.
Done.
Done.
Done.

[]

In [326]:
%%sql
CREATE TABLE COURSES (
    CID INTEGER PRIMARY KEY,
    Program_Code TEXT NOT NULL,
    Program_Name VARCHAR NOT NULL,
    Catalog_ID VARCHAR NOT NULL,
    Course_Title VARCHAR NOT NULL,
    Description VARCHAR,
    Credits VARCHAR NOT NULL,
    Fees VARCHAR,
    Prereqs VARCHAR,
    Coreqs VARCHAR,
    Attributes VARCHAR
);

 * sqlite:///CourseData.db
Done.

[]

In [327]:
%%sql
CREATE TABLE SECTIONS (
    SID INTEGER PRIMARY KEY,
    Catalog_ID VARCHAR NOT NULL,
    Meetings VARCHAR NOT NULL,
    Primary_instructor VARCHAR NOT NULL,
    Title VARCHAR NOT NULL,
    Term VARCHAR NOT NULL,
    act INTEGER NOT NULL,
    rem INTEGER NOT NULL,
    cap INTEGER NOT NULL,
    CRN INTEGER NOT NULL,
    section VARCHAR NOT NULL,
    FOREIGN KEY (Catalog_ID) REFERENCES COURSES (Catalog_ID),
    FOREIGN KEY (Meetings) REFERENCES SCHEDULES (Meetings),
    FOREIGN KEY (Primary_instructor) REFERENCES INSTRUCTORS (Primary_instructor)
);

 * sqlite:///CourseData.db
Done.

[]

In [328]:
%%sql
CREATE TABLE CLASSROOMS (
     LID INTEGER PRIMARY KEY,
     Location VARCHAR NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [329]:
%%sql
CREATE TABLE SCHEDULES (
    SCID INTEGER PRIMARY KEY,
    LID INTEGER NOT NULL,
    Day TEXT NOT NULL,
    Start VARCHAR NOT NULL,
    End VARCHAR NOT NULL,
    Meetings VARCHAR NOT NULL,
    Timecodes VARCHAR NOT NULL,
    FOREIGN KEY (LID) REFERENCES CLASSROOMS (LID)
);

 * sqlite:///CourseData.db
Done.

[]

In [330]:
%%sql
CREATE TABLE INSTRUCTORS (
    IID INTEGER PRIMARY KEY,
    Primary_instructor VARCHAR NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [331]:
%load_ext sql
%sql sqlite:///CourseData.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @CourseData.db'

In [332]:
%%sql
sqlite:///CourseData.db

'Connected: @CourseData.db'

In [333]:
%%sql
INSERT INTO INSTRUCTORS (Primary_instructor)
SELECT DISTINCT Primary_instructor
FROM import_courses;

 * sqlite:///CourseData.db
1105 rows affected.

[]

In [334]:
%%sql
INSERT INTO CLASSROOMS (Location)
SELECT DISTINCT Location
    FROM import_course_meetings;

 * sqlite:///CourseData.db
208 rows affected.

[]

In [335]:
%%sql
INSERT INTO SCHEDULES (LID, Day, Start, End, Meetings, Timecodes)
SELECT DISTINCT LID, Day, Start, End, Meetings, Timecodes
FROM import_course_meetings
    JOIN CLASSROOMS ON (CLASSROOMS.Location=import_course_meetings.location)
    JOIN import_courses ON (import_courses.crn=import_course_meetings.crn AND import_courses.term=import_course_meetings.term)
    Limit 10
    ;

 * sqlite:///CourseData.db
10 rows affected.

[]

In [336]:
%%sql
INSERT INTO COURSES (Program_code, Program_name, Catalog_Id, course_title, credits, prereqs, coreqs, fees, attributes, description)
SELECT DISTINCT Program_code, Program_name, Catalog_Id, course_title, credits, prereqs, coreqs, fees, attributes, description
FROM import_CourseCatalogs

 * sqlite:///CourseData.db
2221 rows affected.

[]

In [337]:
%%sql
INSERT INTO SECTIONS (Catalog_ID, Meetings, Primary_instructor, Title, Term, act, rem, cap, CRN, section)
SELECT DISTINCT Catalog_ID, Meetings, Primary_instructor, Title, Term, act, rem, cap, CRN, section
FROM import_Courses
;

 * sqlite:///CourseData.db
15938 rows affected.

[]

In [338]:
%%sql
SELECT *
FROM SECTIONS
LIMIT 10

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70384, 'C01'),
 (2, 'AC 0011', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70385, 'C02'),
 (3, 'AC 0011', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Michael P.  Coyne', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70382, 'C03'),
 (4, 'AC 0011', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", 'Rebecca I.  Bloch', 'Introduction to Financial Accounting', 'Fall2014', 29, -29, 0, 70291, 'C04'),
 (5, 'AC 0011', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", 'Rebecca I.  Bloch', 'Introduction to Financial Accounting', 'Fall2014', 30, -30, 0, 70350, 'C05'),
 (6, 'AC 0011', "[{'days': 'MR', 'times': '0330pm-0445pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", 'Rebecca I.  Bloch', 'Introduction to Financial Accounting', 'Fall2014', 31, -31, 0, 70381, 'C06'),
 (7, 'AC 0011', "[{'days': 'MR', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", 'Paul   Caster', 'Introduction to Financial Accounting', 'Fall2014', 31, -1, 30, 70383, 'G'),
 (8, 'AC 0011', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", 'Jo Ann   Drusbosky', 'Introduction to Financial Accounting', 'Fall2014', 32, -2, 30, 70391, 'H'),
 (9, 'AC 0011', "[{'days': 'TF', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", 'Jo Ann   Drusbosky', 'Introduction to Financial Accounting', 'Fall2014', 33, -3, 30, 71105, 'I'),
 (10, 'AC 0011', "[{'days': 'TF', 'times': '0200pm-0315pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Jo Ann   Drusbosky', 'Introduction to Financial Accounting', 'Fall2014', 32, -2, 30, 71123, 'J')]